- Each & every ML alogorithm, has some mathematical formula
- Mathematics can be applied only on numerical data

First check unique values of categorical
   - each unique value in discrete categorical----> category
   - check whether categories are nominal or ordinal

# Encoding 
**Converting Discrete Categorical variables to Discrete Numerical variable**
Discrete Categorical is 2 types
  - ordinal : for ordinal data, we have to apply ordinal encoding
  - Nominal : for nominal data, we have to apply nominal encoding

In [1]:
import numpy as np
import pandas as pd

In [2]:
df1 = pd.DataFrame({'shirtsize':['xl','small','medium','large','xl']})
df1

  shirtsize
0        xl
1     small
2    medium
3     large
4        xl

In [4]:
df1['shirtsize'].unique()      #ordinal Data

array(['xl', 'small', 'medium', 'large'], dtype=object)

# ordinal Encoding

- convert to numaric as per given order in the function (ascending order)

In [4]:
from sklearn.preprocessing import OrdinalEncoder

oe = OrdinalEncoder (categories=[['small','medium','large','xl']])

df1['oe_shirtsize'] = oe.fit_transform(df1[['shirtsize']])

df1

  shirtsize  oe_shirtsize
0        xl           3.0
1     small           0.0
2    medium           1.0
3     large           2.0
4        xl           3.0

# Feature Mapping

- convert to numeric,by mapping each category to a value

In [10]:
df1['size_map'] = df1['shirtsize'].map({'small':0,'medium':1,
                                        'large':2,'xl':3})
df1

  shirtsize  oe_shirtsize  size_map
0        xl           3.0         3
1     small           0.0         0
2    medium           1.0         1
3     large           2.0         2
4        xl           3.0         3

In [19]:
df2 = pd.DataFrame({'city':['chennai','bangalore','hyderabad','chennai','bangalore']})
df2

        city
0    chennai
1  bangalore
2  hyderabad
3    chennai
4  bangalore

In [20]:
df2['city'].unique()        # Nominal Data

array(['chennai', 'bangalore', 'hyderabad'], dtype=object)

# Nominal Encoding or Dummy Encoding

In [21]:
pd.get_dummies(df2['city'], drop_first=True, dtype = int)

   chennai  hyderabad
0        1          0
1        0          0
2        0          1
3        1          0
4        0          0

# Label Encoding or Alphabetical Encoding

- in label encoding, each category is assigned a value from 1 to N, where N is the number of categories of that feature.

- it converts to numeric as per alphabetical order

In [22]:
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()

df2['city_le'] = le.fit_transform(df2['city'])

df2

        city  city_le
0    chennai        1
1  bangalore        0
2  hyderabad        2
3    chennai        1
4  bangalore        0